Reports/ОтчетПоЗадолженностиНасиленияФорма_15.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОтчетПоЗадолженностиНасиленияФорма_15</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотребителяУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНормПотребления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияНормПотребления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияРасчетнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеПрибораУчетаДляЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУсловиеРасчетаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДополнительнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйМетод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаПоСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаПоСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаПоСредней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьЭнергоемкость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУХолоднаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУГарячаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоКубов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслугиПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоЗадолженностиНасиленияФорма_15/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецДня(ТекущаяДата())
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтчетНаСервере()
	тзМиргород.Очистить();
	тзбагачка.Очистить();
	Макет = Отчеты.ОтчетПоЗадолженностиНасиленияФорма_15.ПолучитьМакет("Форма15_04_10_2022_Д_15");
	спУслуг = Новый СписокЗначений;
	спУслугТЕ = Новый СписокЗначений;
	спУслугГВ = Новый СписокЗначений;
	спУслугАП = Новый СписокЗначений;
	спУслугТЕ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000187")); // Опалення Багачка
	спУслугАП.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000236")); // Абонплата ТЕ
	спУслугАП.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000234")); // Абонплата ГВ
	спУслугТЕ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000237")); // Опалення Миргород
	спУслугТЕ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000238")); // Опалення Миргород
	спУслугТЕ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000239")); // Опалення Миргород
	спУслугТЕ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000240")); // Опалення Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000246")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000247")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000248")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000249")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000250")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000179")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000241")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000243")); // ГВ Миргород
	спУслугГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000244")); // ГВ Миргород
	
	
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000187")); // Опалення Багачка
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000236")); // Абонплата ТЕ
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000234")); // Абонплата ГВ
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000237")); // Опалення Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000238")); // Опалення Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000239")); // Опалення Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000240")); // Опалення Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000246")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000247")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000248")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000249")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000250")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000179")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000241")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000243")); // ГВ Миргород
	спУслуг.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000244")); // ГВ Миргород
	
	спУслугТЕГВ = Новый СписокЗначений;
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000187")); // Опалення Багачка
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000237")); // Опалення Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000238")); // Опалення Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000239")); // Опалення Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000240")); // Опалення Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000246")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000247")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000248")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000249")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000250")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000179")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000241")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000243")); // ГВ Миргород
	спУслугТЕГВ.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000244")); // ГВ Миргород
	
	
	спУслугАП = Новый СписокЗначений;
	спУслугАП.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000236")); // Абонплата ТЕ
	спУслугАП.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000234")); // Абонплата ГВ
	
	КодКОАТУУМиргород = "5310900000";
	КодКОАТУУБагачка  = "5320255100";
	Результат.Очистить();
	// Отримаємо к-ть абонентів Миргород по ТЕ
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугТЕ);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород = тзМиргород.Добавить();
	НовСтрокаМиргород.КвоАбонентовТЕ = КвоАбонентовМиргород.Количество() / 1000;
	спАбонентовМиргород = Новый СписокЗначений;
	
	// Отримаємо к-ть абонентів Миргород по ГВ
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугГВ);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	//НовСтрокаМиргород = тзМиргород.Добавить();
	НовСтрокаМиргород.КвоАбонентовГВ = КвоАбонентовМиргород.Количество() / 1000;
	спАбонентовМиргород = Новый СписокЗначений;
	
	// Отримаємо к-ть абонентів Миргород по АбонОбслуживанию
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугАП);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	//НовСтрокаМиргород = тзМиргород.Добавить();
	НовСтрокаМиргород.КвоАбонентовАбонОбслуж = КвоАбонентовМиргород.Количество() / 1000;
	спАбонентовМиргород = Новый СписокЗначений;
	
	// Отримаємо загальну кількість абонентів
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслуг);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	спАбонентовМиргород = Новый СписокЗначений;
	Для Каждого стр Из КвоАбонентовМиргород Цикл
		спАбонентовМиргород.Добавить(стр.ЛицевойСчет);
	КонецЦикла;
	
	// Отримаємо к-ть абонентів Багачка
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслуг);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	//НовСтрокаБагачка = тзБагачка.Добавить();
	//НовСтрокаБагачка.КвоАбонентов = КвоАбонентовБагачка.Количество() / 1000;
	спАбонентовБагачка = Новый СписокЗначений;
	Для Каждого стр Из КвоАбонентовБагачка Цикл
		спАбонентовБагачка.Добавить(стр.ЛицевойСчет);
	КонецЦикла;
	
	// отримаємо к-ть абонентів з АбонПлати
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслугАП);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка = тзБагачка.Добавить();
	НовСтрокаБагачка.КвоАбонентовАбонОбслуж = КвоАбонентовБагачка.Количество() / 1000;
	
	// отримаємо к-ть абонентів з ТЕ
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслугТЕ);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	//НовСтрокаБагачка = тзБагачка.Добавить();
	НовСтрокаБагачка.КвоАбонентовТЕ = КвоАбонентовБагачка.Количество() / 1000;
	
	
	// Оплати по абонентам Миргород за останні 3 місяці
	тзДолжники = Новый ТаблицаЗначений;
	тзДолжники.Колонки.Добавить("ЛицевойСчет");
	тзДолжники.Колонки.Добавить("Долг");
	ЗапросДолг3Месяца = Новый Запрос;
	ЗапросДолг3Месяца.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Долг3Месяца,
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ЗапросДолг3Месяца.УстановитьПараметр("ЛицевойСчет",   спАбонентовМиргород);
	ЗапросДолг3Месяца.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Отчет.Период.ДатаНачала), -3));
	ЗапросДолг3Месяца.УстановитьПараметр("КонецПериода",  КонецМесяца(Отчет.Период.ДатаОкончания));
	РезультатОплаты = ЗапросДолг3Месяца.Выполнить();
	ВыборкаОплаты = РезультатОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Долг3Месяца = 1 Тогда
		    НовСтрокаДолг = тзДолжники.Добавить();
			НовСтрокаДолг.ЛицевойСчет = ВыборкаОплаты.ЛицевойСчет;
			НовСтрокаДолг.Долг = ВыборкаОплаты.Долг3Месяца;
		КонецЕсли;
	КонецЦикла;
	НовСтрокаМиргород.КвоАбонентовДолгБольше3Месяцев = тзДолжники.Количество() / 1000;
	
	// Оплати по абонентам Багачка за останні 3 місяці
	тзДолжникиБагачка = Новый ТаблицаЗначений; 
	тзДолжникиБагачка.Колонки.Добавить("ЛицевойСчет");
	тзДолжникиБагачка.Колонки.Добавить("Долг");
	ЗапросДолг3МесяцаБагачка = Новый Запрос;
	ЗапросДолг3МесяцаБагачка.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Долг3Месяца,
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ЗапросДолг3МесяцаБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросДолг3МесяцаБагачка.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Отчет.Период.ДатаНачала), -3));
	ЗапросДолг3МесяцаБагачка.УстановитьПараметр("КонецПериода",  КонецМесяца(Отчет.Период.ДатаОкончания));
	РезультатОплаты = ЗапросДолг3МесяцаБагачка.Выполнить();
	ВыборкаОплаты = РезультатОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Долг3Месяца = 1 Тогда
		    НовСтрокаДолг = тзДолжникиБагачка.Добавить();
			НовСтрокаДолг.ЛицевойСчет = ВыборкаОплаты.ЛицевойСчет;
			НовСтрокаДолг.Долг = ВыборкаОплаты.Долг3Месяца;
		КонецЕсли;
	КонецЦикла;
	НовСтрокаМиргород.КвоАбонентовДолгБольше3Месяцев = тзДолжникиБагачка.Количество() / 1000;
		
	// Виберемо заборгованість по особовим рахункам за вказаний період по Миргороду
	ЗапросДолги = Новый Запрос;
	ЗапросДолги.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолги.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолги.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросДолги.УстановитьПараметр("Услуга", спУслугТЕГВ);
	РезультатДолгМиргород = ЗапросДолги.Выполнить().Выгрузить();
	НовСтрокаМиргород.ДолгТЕиГВНаНачалоПериода = РезультатДолгМиргород.Итог("СуммаОстаток") / 1000;
	
	// Виберемо заборгованість по особовим рахункам за вказаний період по Багачка
	ЗапросДолгиБагачка = Новый Запрос;
	ЗапросДолгиБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолгиБагачка.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолгиБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросДолгиБагачка.УстановитьПараметр("Услуга", спУслугТЕГВ);
	РезультатДолгБагачка = ЗапросДолгиБагачка.Выполнить().Выгрузить(); 
	НовСтрокаБагачка.ДолгТЕиГВНаНачалоПериода = РезультатДолгБагачка.Итог("СуммаОстаток") / 1000;
	
	
	// Виберемо нарахування за звітній період по Миргороду
	ЗапросНачисленияМиргород = Новый Запрос;
	ЗапросНачисленияМиргород.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга";
	ЗапросНачисленияМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросНачисленияМиргород.УстановитьПараметр("Услуга", спУслугТЕГВ);
	РезультатНачисления = ЗапросНачисленияМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.НачисленоТЕиГВЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо нарахування за звітній період по Багачка
	ЗапросНачисленияБагачка = Новый Запрос;
	ЗапросНачисленияБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
	ЗапросНачисленияБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросНачисленияБагачка.УстановитьПараметр("Услуга",спУслугТЕГВ);
	РезультатНачисления = ЗапросНачисленияБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.НачисленоТЕиГВЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо оплати за звітній період по Миргороду
	ЗапросОплатиМиргород = Новый Запрос;
	ЗапросОплатиМиргород.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатиМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатиМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатиМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросОплатиМиргород.УстановитьПараметр("Услуга", спУслугТЕГВ);
	РезультатНачисления = ЗапросОплатиМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.ОплаченоТЕиГВЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Виберемо оплати за звітній період по Багачка
	ЗапросОплатыБагачка = Новый Запрос;
	ЗапросОплатыБагачка.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатыБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатыБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатыБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросОплатыБагачка.УстановитьПараметр("Услуга", спУслугТЕГВ);
	РезультатНачисления = ЗапросОплатыБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.ОплаченоТЕиГВЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Залишок боргу на кінець звітного періоду
	НовСтрокаМиргород.ДолгЗаТЕиГВНаКонецПериод = НовСтрокаМиргород.ДолгТЕиГВНаНачалоПериода - НовСтрокаМиргород.ОплаченоТЕиГВЗаПериод + НовстрокаМиргород.НачисленоТЕиГВЗаПериод;
	НовСтрокаБагачка.ДолгЗаТЕиГВНаКонецПериод  = НовСтрокаБагачка.ДолгТЕиГВНаНачалоПериода - НовСтрокаБагачка.ОплаченоТЕиГВЗаПериод + НовСтрокаБагачка.НачисленоТЕиГВЗаПериод;
	
	// Виберемо заборгованість по Абоненському обслуговуванню на початок звітнього періоду по Миргороду
	ЗапросДолги = Новый Запрос;
	ЗапросДолги.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолги.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолги.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросДолги.УстановитьПараметр("Услуга", спУслугАП);
	НовСтрокаМиргород.ДолгАПНаНачалоПериода = ЗапросДолги.Выполнить().Выгрузить().Итог("СуммаОстаток") / 1000;
	
	// Виберемо заборгованість по Абоненському обслуговуванню на початок звітнього періоду по Багачка
	ЗапросДолгиБагачка = Новый Запрос;
	ЗапросДолгиБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолгиБагачка.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолгиБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросДолгиБагачка.УстановитьПараметр("Услуга", спУслугАП);
	НовСтрокаМиргород.ДолгАПНаНачалоПериода = ЗапросДолгиБагачка.Выполнить().Выгрузить().Итог("СуммаОстаток") / 1000;
	
	// Виберемо нарахування по АП за звітній період по Миргороду
	ЗапросНачисленияАП = Новый Запрос;
	ЗапросНачисленияАП.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
	ЗапросНачисленияАП.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияАП.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияАП.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросНачисленияАП.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросНачисленияАП.Выполнить().Выгрузить();
	НовСтрокаМиргород.НачисленоАПЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо нарахування по АП за звітній період по Багачка
	ЗапросНачисленияАПБагачка = Новый Запрос;
	ЗапросНачисленияАПБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
	ЗапросНачисленияАПБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияАПБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияАПБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросНачисленияАПБагачка.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросНачисленияАПБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.НачисленоАПЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо оплати по АП за звітній період по Миргород
	ЗапросОплатаАП = Новый Запрос;
	ЗапросОплатаАП.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатаАП.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатаАП.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатаАП.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросОплатаАП.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросОплатаАП.Выполнить().Выгрузить();
	НовСтрокаМиргород.ОплаченоАПЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Виберемо оплати по АП за звітній період по Багачка
	ЗапросОплатаАПБагачка = Новый Запрос;
	ЗапросОплатаАПБагачка.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатаАПБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатаАПБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатаАПБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросОплатаАПБагачка.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросОплатаАПБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.ОплаченоАПЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Борг по АП на кінець звітного періоду
	НовСтрокаМиргород.ДолгАПНаКонецПериода = НовСтрокаМиргород.ДолгАПНаНачалоПериода - НовСтрокаМиргород.ОплаченоАПЗаПериод;
	НовСтрокаБагачка.ДолгАПНаКонецПериода = НовСтрокаБагачка.ДолгАПНаНачалоПериода - НовСтрокаБагачка.ОплаченоАПЗаПериод;
	
	// Заполним табличный документ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = Отчет.Период;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 1;
	ОбластьСтрока.Параметры.Организация                       = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьСтрока.Параметры.НаселенныйПункт                   = "Миргород";
	ОбластьСтрока.Параметры.ОКПП                              = "45136285";
	ОбластьСтрока.Параметры.КвоАбонентовТЕ                    = тзМиргород[0].КвоАбонентовТЕ;
	ОбластьСтрока.Параметры.КвоАбонентовГВ                    = тзМиргород[0].КвоАбонентовГВ;
	ОбластьСтрока.Параметры.КвоАбонентовАбонОбслуж            = тзМиргород[0].КвоАбонентовАбонОбслуж;
	ОбластьСтрока.Параметры.КвоАбонентовСДолгомБольше3Месяцев = тзМиргород[0].КвоАбонентовДолгБольше3Месяцев;
	ОбластьСтрока.Параметры.ДолгНаНачалоПериода               = тзМиргород[0].ДолгТЕиГВНаНачалоПериода;
	ОбластьСтрока.Параметры.НачисленоТЕиГВЗаПериод            = тзМиргород[0].НачисленоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ОплаченоТЕиГВЗаПериод             = тзМиргород[0].ОплаченоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ДолгЗаТЕиГВНаКонецПериод          = тзМиргород[0].ДолгЗаТЕиГВНаКонецПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженностьНаНачало    = тзМиргород[0].ДолгАПНаНачалоПериода;
	ОбластьСтрока.Параметры.АбонплатаНачислено                = тзМиргород[0].НачисленоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонПлатаОплачено                 = тзМиргород[0].ОплаченоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженостьКонец        = тзМиргород[0].ДолгАПНаКонецПериода;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 2;
	ОбластьСтрока.Параметры.Организация                       = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьСтрока.Параметры.НаселенныйПункт                   = "смт.Велика Багачка";
	ОбластьСтрока.Параметры.ОКПП                              = "45136285";
	ОбластьСтрока.Параметры.КвоАбонентовТЕ                    = тзБагачка[0].КвоАбонентовТЕ;
	//ОбластьСтрока.Параметры.КвоАбонентовГВ                    = тзБагачка[0].КвоАбонентовГВ;
	ОбластьСтрока.Параметры.КвоАбонентовАбонОбслуж            = тзБагачка[0].КвоАбонентовАбонОбслуж;
	ОбластьСтрока.Параметры.КвоАбонентовСДолгомБольше3Месяцев = тзБагачка[0].КвоАбонентовДолгБольше3Месяцев;
	ОбластьСтрока.Параметры.ДолгНаНачалоПериода               = тзБагачка[0].ДолгТЕиГВНаНачалоПериода;
	ОбластьСтрока.Параметры.НачисленоТЕиГВЗаПериод            = тзБагачка[0].НачисленоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ОплаченоТЕиГВЗаПериод             = тзБагачка[0].ОплаченоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ДолгЗаТЕиГВНаКонецПериод          = тзБагачка[0].ДолгЗаТЕиГВНаКонецПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженностьНаНачало    = тзБагачка[0].ДолгАПНаНачалоПериода;
	ОбластьСтрока.Параметры.АбонплатаНачислено                = тзБагачка[0].НачисленоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонПлатаОплачено                 = тзБагачка[0].ОплаченоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженостьКонец        = тзБагачка[0].ДолгАПНаКонецПериода;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчет(Команда)
	ЗаполнитьОтчетНаСервере();
КонецПроцедуры
